In [1]:
import pandas as pd

In [2]:
chicago=pd.read_csv("chicago.csv").dropna(how="all")
chicago["Department"]=chicago["Department"].astype("category")
chicago["Position Title"]=chicago["Position Title"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [3]:
chicago.isna().sum()

Name                      0
Position Title            0
Department                0
Employee Annual Salary    0
dtype: int64

In [4]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  category
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(2), object(2)
memory usage: 887.5+ KB

In [5]:
chicago["Department"].nunique()

35

In [6]:
chicago["Department"].value_counts()

POLICE                   12618
FIRE                      4796
STREETS & SAN             2152
OEMC                      1982
WATER MGMNT               1840
AVIATION                  1521
TRANSPORTN                1073
PUBLIC LIBRARY             961
GENERAL SERVICES           930
FAMILY & SUPPORT           654
FINANCE                    577
HEALTH                     529
LAW                        414
CITY COUNCIL               396
BUILDINGS                  262
COMMUNITY DEVELOPMENT      208
BUSINESS AFFAIRS           161
BOARD OF ELECTION          117
DoIT                       102
CITY CLERK                  94
MAYOR'S OFFICE              86
PROCUREMENT                 83
IPRA                        82
CULTURAL AFFAIRS            74
HUMAN RESOURCES             70
ANIMAL CONTRL               67
INSPECTOR GEN               57
BUDGET & MGMT               39
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              9
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

In [7]:
len(chicago["Department"].value_counts())

35

In [8]:
chicago["Position Title"].nunique()

1093

In [9]:
chicago["Position Title"].value_counts()

POLICE OFFICER                            9184
FIREFIGHTER-EMT                           1208
SERGEANT                                  1185
POOL MOTOR TRUCK DRIVER                    918
POLICE OFFICER (ASSIGNED AS DETECTIVE)     896
                                          ...
ENVIRONMENTAL POLICY ANALYST                 1
ENVIRONMENTAL ENGINEER I                     1
ENGINEERING TECHNICIAN III                   1
ENGINEER OF WATER PURIFICATION               1
FORENSIC AUDIT INVESTIGATOR                  1
Name: Position Title, Length: 1093, dtype: int64

## Common String Methods - lower, upper, title, and len

In [10]:
"HELLO WORLD".lower()
"hello world".upper()
"hello world".title()
len("Hello World")

11

In [11]:
chicago["Name"]=chicago["Name"].str.title()

In [12]:
chicago["Name"].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32057    zygadlo,  michael j
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
Name: Name, Length: 32062, dtype: object

In [13]:
chicago["Name"].str.upper()

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

In [14]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
2,"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
3,"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [15]:
chicago["Position Title"]=chicago["Position Title"].str.title()

In [16]:
chicago["Position Title"]

0                      Water Rate Taker
1                        Police Officer
2                        Police Officer
3              Chief Contract Expediter
4                     Civil Engineer Iv
                      ...
32057    Frm Of Machinists - Automotive
32058                    Police Officer
32059                    Police Officer
32060                    Police Officer
32061           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: object

In [17]:
chicago["Name"].str.len()

0        15
1        17
2        14
3        19
4        19
         ..
32057    19
32058    18
32059    17
32060    19
32061    19
Name: Name, Length: 32062, dtype: int64

## The .str.replace() Method

In [18]:
"Hallo World".replace("l", "!")

'Ha!!o Wor!d'

In [19]:
chicago.head(10)

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MGMNT,$90744.00
1,"Aaron, Jeffery M",Police Officer,POLICE,$84450.00
2,"Aaron, Karina",Police Officer,POLICE,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MGMNT,$106836.00
5,"Abarca, Anabel",Asst To The Alderman,CITY COUNCIL,$70764.00
6,"Abarca, Emmanuel",General Laborer - Dss,STREETS & SAN,$41849.60
7,"Abascal, Reece E",Traffic Control Aide-Hourly,OEMC,$20051.20
8,"Abbasi, Christopher",Staff Asst To The Alderman,CITY COUNCIL,$49452.00
9,"Abbatacola, Robert J",Electrical Mechanic,AVIATION,$93600.00

In [20]:
chicago["Department"]=chicago["Department"].str.replace("MGMNT", "MANAGEMENT")

In [21]:
chicago["Employee Annual Salary"]=chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

C:\Users\Bilal\AppData\Local\Temp\ipykernel_11268\3648855646.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chicago["Employee Annual Salary"]=chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

In [22]:
chicago["Employee Annual Salary"].sum()

2571506375.36

In [23]:
chicago["Employee Annual Salary"].std()

25098.32986750994

In [24]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
1,"Aaron, Jeffery M",Police Officer,POLICE,84450.0
2,"Aaron, Karina",Police Officer,POLICE,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MANAGEMENT,106836.0

In [25]:
chicago["Employee Annual Salary"].nlargest(10)

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
19208    195000.0
3706     187680.0
18556    187680.0
29466    187680.0
13754    185364.0
Name: Employee Annual Salary, dtype: float64

In [26]:
chicago["Employee Annual Salary"].nsmallest(10)

15102       0.96
12       2756.00
27       2756.00
47       2756.00
295      2756.00
380      2756.00
686      2756.00
751      2756.00
959      2756.00
1093     2756.00
Name: Employee Annual Salary, dtype: float64

## Filtering with String Methods

In [27]:
mask=chicago["Position Title"].str.lower().str.contains("water")

In [28]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
554,"Aluise, Vincent G",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
671,"Ander, Perry A",Water Chemist Ii,WATER MANAGEMENT,82044.0
685,"Anderson, Andrew J",District Superintendent Of Water Distribution,WATER MANAGEMENT,109272.0
702,"Anderson, Donald",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
...,...,...,...,...
29669,"Verma, Anupam",Managing Engineer - Water Management,WATER MANAGEMENT,111192.0
30239,"Washington, Joseph",Water Chemist Iii,WATER MANAGEMENT,89676.0
30544,"West, Thomas R",Gen Supt Of Water Management,WATER MANAGEMENT,115704.0
30991,"Williams, Matthew",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
31405,"Woodridge, Robert L",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0

In [29]:
mask1=chicago["Position Title"].str.lower().str.startswith("water")

In [30]:
chicago[mask1]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
671,"Ander, Perry A",Water Chemist Ii,WATER MANAGEMENT,82044.0
1054,"Ashley, Karma T",Water Chemist Ii,WATER MANAGEMENT,82044.0
1079,"Atkins, Joanna M",Water Chemist Ii,WATER MANAGEMENT,82044.0
1181,"Azeem, Mohammed A",Water Chemist Ii,WATER MANAGEMENT,53172.0
...,...,...,...,...
28574,"Threatt, Denise R",Water Quality Inspector,WATER MANAGEMENT,62004.0
28602,"Tignor, Darryl B",Water Rate Taker,WATER MANAGEMENT,78948.0
28955,"Travis Cook, Leslie R",Water Rate Taker,WATER MANAGEMENT,78948.0
29584,"Velazquez, John",Water Rate Taker,WATER MANAGEMENT,78948.0
30239,"Washington, Joseph",Water Chemist Iii,WATER MANAGEMENT,89676.0

In [31]:
chicago[chicago["Position Title"].str.lower().str.endswith("ist")]

,Name,Position Title,Department,Employee Annual Salary
184,"Afroz, Nayyar",Psychiatrist,HEALTH,99840.0
308,"Alarcon, Luis J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,81948.0
422,"Allain, Carolyn",Senior Telecommunications Specialist,DoIT,89880.0
472,"Allen, Robert",Machinist,WATER MANAGEMENT,94328.0
705,"Anderson, Edward M",Sr Procurement Specialist,PROCUREMENT,91476.0
...,...,...,...,...
31667,"Yoder, Teresa G",Archival Specialist,PUBLIC LIBRARY,74304.0
31688,"Youngbloom, Laurence G",Crimes Surveillance Specialist,OEMC,19676.8
31717,"Young, Kimberly M",Sr Procurement Specialist,PROCUREMENT,68556.0
31837,"Zapata, Hugo",Sr Procurement Specialist,PROCUREMENT,87324.0
31918,"Zemke, Richard P",Machinist,AVIATION,94328.0

## More String Methods - strip, lstrip, and rstrip

In [32]:
a="       Hello WOrld     "

In [33]:
a=a.lstrip()

In [34]:
a

'Hello WOrld     '

In [35]:
a.rstrip()

'Hello WOrld'

In [36]:
a.strip()

'Hello WOrld'

In [37]:
chicago["Name"].str.strip()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32057    Zygadlo,  Michael J
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
Name: Name, Length: 32062, dtype: object

In [38]:
chicago["Position Title"].str.strip()

0                      Water Rate Taker
1                        Police Officer
2                        Police Officer
3              Chief Contract Expediter
4                     Civil Engineer Iv
                      ...
32057    Frm Of Machinists - Automotive
32058                    Police Officer
32059                    Police Officer
32060                    Police Officer
32061           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: object

In [39]:
chicago["Department"].str.lstrip().str.rstrip()

0        WATER MANAGEMENT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4        WATER MANAGEMENT
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: object

## String Methods on Index and Columns

In [40]:
chicago=pd.read_csv("chicago.csv", index_col="Name").dropna(how="all")
chicago["Department"]=chicago["Department"].astype("category")
chicago["Position Title"]=chicago["Position Title"].astype("category")
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [41]:
# chicago["Name"]

In [42]:
chicago.index=chicago.index.str.strip().str.title()

In [43]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [44]:
chicago.columns=chicago.columns.str.upper()

In [45]:
chicago.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [46]:
chicago.columns=chicago.columns.str.replace("POSITION TITLE", "Pos T") # Rename Collumn Lebel

## Split Strings by Characters with .str.split() Method

In [47]:
a="Hello My Name is Bilal".split(" ")

In [48]:
a[3]

'is'

In [49]:
first_name=chicago.index.str.split(",").str.get(0)

In [50]:
first_name

Index(['Aaron', 'Aaron', 'Aaron', 'Aaron', 'Abad Jr', 'Abarca', 'Abarca',
       'Abascal', 'Abbasi', 'Abbatacola',
       ...
       'Zwit', 'Zwolfer', 'Zych', 'Zydek', 'Zygadlo', 'Zygadlo', 'Zygowicz',
       'Zymantas', 'Zyrkowski', 'Zyskowski'],
      dtype='object', name='Name', length=32062)

In [51]:
last_name=chicago.index.str.split(",").str.get(1)

In [52]:
last_name=last_name.str.strip()
last_name

Index(['Elvia J', 'Jeffery M', 'Karina', 'Kimberlei R', 'Vicente M', 'Anabel',
       'Emmanuel', 'Reece E', 'Christopher', 'Robert J',
       ...
       'Jeffrey J', 'Matthew W', 'Mateusz', 'Bryan', 'John P', 'Michael J',
       'Peter J', 'Mark E', 'Carlo E', 'Dariusz'],
      dtype='object', name='Name', length=32062)

In [53]:
chicago["First Name"]=first_name

In [54]:
chicago["Last Name"]=last_name

In [55]:
chicago.head()

,Pos T,DEPARTMENT,EMPLOYEE ANNUAL SALARY,First Name,Last Name
Name,,,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia J
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery M
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00,Aaron,Karina
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei R
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente M

In [57]:
chicago.insert(0, column="First Name1", value=first_name)
chicago.insert(1, column="Last Name1", value=last_name)

In [58]:
chicago.head()

,First Name1,Last Name1,Pos T,DEPARTMENT,EMPLOYEE ANNUAL SALARY,First Name,Last Name
Name,,,,,,,
"Aaron, Elvia J",Aaron,Elvia J,WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia J
"Aaron, Jeffery M",Aaron,Jeffery M,POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery M
"Aaron, Karina",Aaron,Karina,POLICE OFFICER,POLICE,$84450.00,Aaron,Karina
"Aaron, Kimberlei R",Aaron,Kimberlei R,CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei R
"Abad Jr, Vicente M",Abad Jr,Vicente M,CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente M

## More Practice with Splits

In [59]:
middle_name=chicago.index.str.split(",").str.get(1).str.strip().str.split().str.get(0)
last_name=chicago.index.str.split(",").str.get(1).str.strip().str.split().str.get(1)

## The expand and n Parameters of the .str.split() Method

In [63]:
# chicago[["First Name", "Last Name"]]=chicago["Name"].str.split(",", expand=True)

In [64]:
chicago.head()

,First Name1,Last Name1,Pos T,DEPARTMENT,EMPLOYEE ANNUAL SALARY,First Name,Last Name
Name,,,,,,,
"Aaron, Elvia J",Aaron,Elvia J,WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia J
"Aaron, Jeffery M",Aaron,Jeffery M,POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery M
"Aaron, Karina",Aaron,Karina,POLICE OFFICER,POLICE,$84450.00,Aaron,Karina
"Aaron, Kimberlei R",Aaron,Kimberlei R,CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei R
"Abad Jr, Vicente M",Abad Jr,Vicente M,CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente M